{
    "weight_map": {
        "model.embed_tokens.weight": "model-00000-of-00413.safetensors",
        "model.layers.0.input_layernorm.weight": "model-00001-of-00413.safetensors",
        "model.layers.0.self_attn.qkv_proj.weight": "model-00001-of-00413.safetensors",
        "model.layers.0.self_attn.output_gate.weight": "model-00001-of-00413.safetensors",
        "model.layers.0.self_attn.norm.weight": "model-00001-of-00413.safetensors",
        "model.layers.0.self_attn.out_proj.weight": "model-00001-of-00413.safetensors",
        "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.gate.weight": "model-00001-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.0.w1.weight": "model-00001-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.0.w3.weight": "model-00001-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.0.w2.weight": "model-00001-of-00413.safetensors",
        "model.layers.1.input_layernorm.weight": "model-00001-of-00413.safetensors",
        "model.layers.1.self_attn.qkv_proj.weight": "model-00001-of-00413.safetensors",
        "model.layers.1.self_attn.output_gate.weight": "model-00001-of-00413.safetensors",
        "model.layers.1.self_attn.norm.weight": "model-00001-of-00413.safetensors",
        "model.layers.1.self_attn.out_proj.weight": "model-00001-of-00413.safetensors",
        "model.layers.1.post_attention_layernorm.weight": "model-00001-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.gate.weight": "model-00001-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.0.w1.weight": "model-00001-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.0.w3.weight": "model-00001-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.0.w2.weight": "model-00001-of-00413.safetensors",
        "model.layers.2.input_layernorm.weight": "model-00001-of-00413.safetensors",
        "model.layers.2.self_attn.qkv_proj.weight": "model-00001-of-00413.safetensors",
        "model.layers.2.self_attn.output_gate.weight": "model-00001-of-00413.safetensors",
        "model.layers.2.self_attn.norm.weight": "model-00001-of-00413.safetensors",
        "model.layers.2.self_attn.out_proj.weight": "model-00001-of-00413.safetensors",
        "model.layers.2.post_attention_layernorm.weight": "model-00002-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.gate.weight": "model-00002-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.0.w1.weight": "model-00002-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.0.w3.weight": "model-00002-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.0.w2.weight": "model-00002-of-00413.safetensors",
        "model.layers.3.input_layernorm.weight": "model-00002-of-00413.safetensors",
        "model.layers.3.self_attn.qkv_proj.weight": "model-00002-of-00413.safetensors",
        "model.layers.3.self_attn.output_gate.weight": "model-00002-of-00413.safetensors",
        "model.layers.3.self_attn.norm.weight": "model-00002-of-00413.safetensors",
        "model.layers.3.self_attn.out_proj.weight": "model-00002-of-00413.safetensors",
        "model.layers.3.post_attention_layernorm.weight": "model-00002-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.gate.weight": "model-00002-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.0.w1.weight": "model-00002-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.0.w3.weight": "model-00002-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.0.w2.weight": "model-00002-of-00413.safetensors",
        "model.layers.4.input_layernorm.weight": "model-00002-of-00413.safetensors",
        "model.layers.4.self_attn.qkv_proj.weight": "model-00002-of-00413.safetensors",
        "model.layers.4.self_attn.output_gate.weight": "model-00002-of-00413.safetensors",
        "model.layers.4.self_attn.norm.weight": "model-00002-of-00413.safetensors",
        "model.layers.4.self_attn.out_proj.weight": "model-00002-of-00413.safetensors",
        "model.layers.4.post_attention_layernorm.weight": "model-00002-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.gate.weight": "model-00002-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.0.w1.weight": "model-00002-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.0.w3.weight": "model-00002-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.0.w2.weight": "model-00002-of-00413.safetensors",
        "model.layers.5.input_layernorm.weight": "model-00002-of-00413.safetensors",
        "model.layers.5.self_attn.qkv_proj.weight": "model-00002-of-00413.safetensors",
        "model.layers.5.self_attn.output_gate.weight": "model-00003-of-00413.safetensors",
        "model.layers.5.self_attn.norm.weight": "model-00003-of-00413.safetensors",
        "model.layers.5.self_attn.out_proj.weight": "model-00003-of-00413.safetensors",
        "model.layers.5.post_attention_layernorm.weight": "model-00003-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.gate.weight": "model-00003-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.0.w1.weight": "model-00003-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.0.w3.weight": "model-00003-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.0.w2.weight": "model-00003-of-00413.safetensors",
        "model.layers.6.input_layernorm.weight": "model-00003-of-00413.safetensors",
        "model.layers.6.self_attn.qkv_proj.weight": "model-00003-of-00413.safetensors",
        "model.layers.6.self_attn.output_gate.weight": "model-00003-of-00413.safetensors",
        "model.layers.6.self_attn.norm.weight": "model-00003-of-00413.safetensors",
        "model.layers.6.self_attn.out_proj.weight": "model-00003-of-00413.safetensors",
        "model.layers.6.post_attention_layernorm.weight": "model-00003-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.gate.weight": "model-00003-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.0.w1.weight": "model-00003-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.0.w3.weight": "model-00003-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.0.w2.weight": "model-00003-of-00413.safetensors",
        "model.layers.7.input_layernorm.weight": "model-00003-of-00413.safetensors",
        "model.layers.7.self_attn.q_proj.weight": "model-00003-of-00413.safetensors",
        "model.layers.7.self_attn.k_proj.weight": "model-00003-of-00413.safetensors",
        "model.layers.7.self_attn.v_proj.weight": "model-00003-of-00413.safetensors",
        "model.layers.7.self_attn.o_proj.weight": "model-00003-of-00413.safetensors",
        "model.layers.7.post_attention_layernorm.weight": "model-00003-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.gate.weight": "model-00003-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.0.w1.weight": "model-00003-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.0.w3.weight": "model-00003-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.0.w2.weight": "model-00003-of-00413.safetensors",
        "model.layers.8.input_layernorm.weight": "model-00003-of-00413.safetensors",
        "model.layers.8.self_attn.qkv_proj.weight": "model-00003-of-00413.safetensors",
        "model.layers.8.self_attn.output_gate.weight": "model-00004-of-00413.safetensors",
        "model.layers.8.self_attn.norm.weight": "model-00004-of-00413.safetensors",
        "model.layers.8.self_attn.out_proj.weight": "model-00004-of-00413.safetensors",
        "model.layers.8.post_attention_layernorm.weight": "model-00004-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.gate.weight": "model-00004-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.0.w1.weight": "model-00004-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.0.w3.weight": "model-00004-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.0.w2.weight": "model-00004-of-00413.safetensors",
        "model.layers.9.input_layernorm.weight": "model-00004-of-00413.safetensors",
        "model.layers.9.self_attn.qkv_proj.weight": "model-00004-of-00413.safetensors",
        "model.layers.9.self_attn.output_gate.weight": "model-00004-of-00413.safetensors",
        "model.layers.9.self_attn.norm.weight": "model-00004-of-00413.safetensors",
        "model.layers.9.self_attn.out_proj.weight": "model-00004-of-00413.safetensors",
        "model.layers.9.post_attention_layernorm.weight": "model-00004-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.gate.weight": "model-00004-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.0.w1.weight": "model-00004-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.0.w3.weight": "model-00004-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.0.w2.weight": "model-00004-of-00413.safetensors",
        "model.layers.10.input_layernorm.weight": "model-00004-of-00413.safetensors",
        "model.layers.10.self_attn.qkv_proj.weight": "model-00004-of-00413.safetensors",
        "model.layers.10.self_attn.output_gate.weight": "model-00004-of-00413.safetensors",
        "model.layers.10.self_attn.norm.weight": "model-00004-of-00413.safetensors",
        "model.layers.10.self_attn.out_proj.weight": "model-00004-of-00413.safetensors",
        "model.layers.10.post_attention_layernorm.weight": "model-00004-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.gate.weight": "model-00004-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.0.w1.weight": "model-00004-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.0.w3.weight": "model-00004-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.0.w2.weight": "model-00005-of-00413.safetensors",
        "model.layers.11.input_layernorm.weight": "model-00005-of-00413.safetensors",
        "model.layers.11.self_attn.qkv_proj.weight": "model-00005-of-00413.safetensors",
        "model.layers.11.self_attn.output_gate.weight": "model-00005-of-00413.safetensors",
        "model.layers.11.self_attn.norm.weight": "model-00005-of-00413.safetensors",
        "model.layers.11.self_attn.out_proj.weight": "model-00005-of-00413.safetensors",
        "model.layers.11.post_attention_layernorm.weight": "model-00005-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.gate.weight": "model-00005-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.0.w1.weight": "model-00005-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.0.w3.weight": "model-00005-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.0.w2.weight": "model-00005-of-00413.safetensors",
        "model.layers.12.input_layernorm.weight": "model-00005-of-00413.safetensors",
        "model.layers.12.self_attn.qkv_proj.weight": "model-00005-of-00413.safetensors",
        "model.layers.12.self_attn.output_gate.weight": "model-00005-of-00413.safetensors",
        "model.layers.12.self_attn.norm.weight": "model-00005-of-00413.safetensors",
        "model.layers.12.self_attn.out_proj.weight": "model-00005-of-00413.safetensors",
        "model.layers.12.post_attention_layernorm.weight": "model-00005-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.gate.weight": "model-00005-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.0.w1.weight": "model-00005-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.0.w3.weight": "model-00005-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.0.w2.weight": "model-00005-of-00413.safetensors",
        "model.layers.13.input_layernorm.weight": "model-00005-of-00413.safetensors",
        "model.layers.13.self_attn.qkv_proj.weight": "model-00005-of-00413.safetensors",
        "model.layers.13.self_attn.output_gate.weight": "model-00006-of-00413.safetensors",
        "model.layers.13.self_attn.norm.weight": "model-00006-of-00413.safetensors",
        "model.layers.13.self_attn.out_proj.weight": "model-00006-of-00413.safetensors",
        "model.layers.13.post_attention_layernorm.weight": "model-00006-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.gate.weight": "model-00006-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.0.w1.weight": "model-00006-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.0.w3.weight": "model-00006-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.0.w2.weight": "model-00006-of-00413.safetensors",
        "model.layers.14.input_layernorm.weight": "model-00006-of-00413.safetensors",
        "model.layers.14.self_attn.qkv_proj.weight": "model-00006-of-00413.safetensors",
        "model.layers.14.self_attn.output_gate.weight": "model-00006-of-00413.safetensors",
        "model.layers.14.self_attn.norm.weight": "model-00006-of-00413.safetensors",
        "model.layers.14.self_attn.out_proj.weight": "model-00006-of-00413.safetensors",
        "model.layers.14.post_attention_layernorm.weight": "model-00006-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.gate.weight": "model-00006-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.0.w1.weight": "model-00006-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.0.w3.weight": "model-00006-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.0.w2.weight": "model-00006-of-00413.safetensors",
        "model.layers.15.input_layernorm.weight": "model-00006-of-00413.safetensors",
        "model.layers.15.self_attn.q_proj.weight": "model-00006-of-00413.safetensors",
        "model.layers.15.self_attn.k_proj.weight": "model-00006-of-00413.safetensors",
        "model.layers.15.self_attn.v_proj.weight": "model-00006-of-00413.safetensors",
        "model.layers.15.self_attn.o_proj.weight": "model-00006-of-00413.safetensors",
        "model.layers.15.post_attention_layernorm.weight": "model-00006-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.gate.weight": "model-00006-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.0.w1.weight": "model-00006-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.0.w3.weight": "model-00006-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.0.w2.weight": "model-00006-of-00413.safetensors",
        "model.layers.16.input_layernorm.weight": "model-00006-of-00413.safetensors",
        "model.layers.16.self_attn.qkv_proj.weight": "model-00006-of-00413.safetensors",
        "model.layers.16.self_attn.output_gate.weight": "model-00007-of-00413.safetensors",
        "model.layers.16.self_attn.norm.weight": "model-00007-of-00413.safetensors",
        "model.layers.16.self_attn.out_proj.weight": "model-00007-of-00413.safetensors",
        "model.layers.16.post_attention_layernorm.weight": "model-00007-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.gate.weight": "model-00007-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.0.w1.weight": "model-00007-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.0.w3.weight": "model-00007-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.0.w2.weight": "model-00007-of-00413.safetensors",
        "model.layers.17.input_layernorm.weight": "model-00007-of-00413.safetensors",
        "model.layers.17.self_attn.qkv_proj.weight": "model-00007-of-00413.safetensors",
        "model.layers.17.self_attn.output_gate.weight": "model-00007-of-00413.safetensors",
        "model.layers.17.self_attn.norm.weight": "model-00007-of-00413.safetensors",
        "model.layers.17.self_attn.out_proj.weight": "model-00007-of-00413.safetensors",
        "model.layers.17.post_attention_layernorm.weight": "model-00007-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.gate.weight": "model-00007-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.0.w1.weight": "model-00007-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.0.w3.weight": "model-00007-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.0.w2.weight": "model-00007-of-00413.safetensors",
        "model.layers.18.input_layernorm.weight": "model-00007-of-00413.safetensors",
        "model.layers.18.self_attn.qkv_proj.weight": "model-00007-of-00413.safetensors",
        "model.layers.18.self_attn.output_gate.weight": "model-00007-of-00413.safetensors",
        "model.layers.18.self_attn.norm.weight": "model-00007-of-00413.safetensors",
        "model.layers.18.self_attn.out_proj.weight": "model-00007-of-00413.safetensors",
        "model.layers.18.post_attention_layernorm.weight": "model-00007-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.gate.weight": "model-00007-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.0.w1.weight": "model-00007-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.0.w3.weight": "model-00007-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.0.w2.weight": "model-00008-of-00413.safetensors",
        "model.layers.19.input_layernorm.weight": "model-00008-of-00413.safetensors",
        "model.layers.19.self_attn.qkv_proj.weight": "model-00008-of-00413.safetensors",
        "model.layers.19.self_attn.output_gate.weight": "model-00008-of-00413.safetensors",
        "model.layers.19.self_attn.norm.weight": "model-00008-of-00413.safetensors",
        "model.layers.19.self_attn.out_proj.weight": "model-00008-of-00413.safetensors",
        "model.layers.19.post_attention_layernorm.weight": "model-00008-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.gate.weight": "model-00008-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.0.w1.weight": "model-00008-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.0.w3.weight": "model-00008-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.0.w2.weight": "model-00008-of-00413.safetensors",
        "model.layers.20.input_layernorm.weight": "model-00008-of-00413.safetensors",
        "model.layers.20.self_attn.qkv_proj.weight": "model-00008-of-00413.safetensors",
        "model.layers.20.self_attn.output_gate.weight": "model-00008-of-00413.safetensors",
        "model.layers.20.self_attn.norm.weight": "model-00008-of-00413.safetensors",
        "model.layers.20.self_attn.out_proj.weight": "model-00008-of-00413.safetensors",
        "model.layers.20.post_attention_layernorm.weight": "model-00008-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.gate.weight": "model-00008-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.0.w1.weight": "model-00008-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.0.w3.weight": "model-00008-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.0.w2.weight": "model-00008-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.1.w1.weight": "model-00008-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.1.w3.weight": "model-00008-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.1.w2.weight": "model-00008-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.1.w1.weight": "model-00009-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.1.w3.weight": "model-00009-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.1.w2.weight": "model-00009-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.1.w1.weight": "model-00009-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.1.w3.weight": "model-00009-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.1.w2.weight": "model-00009-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.1.w1.weight": "model-00009-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.1.w3.weight": "model-00009-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.1.w2.weight": "model-00009-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.1.w1.weight": "model-00009-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.1.w3.weight": "model-00009-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.1.w2.weight": "model-00009-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.1.w1.weight": "model-00009-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.1.w3.weight": "model-00009-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.1.w2.weight": "model-00009-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.1.w1.weight": "model-00009-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.1.w3.weight": "model-00009-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.1.w2.weight": "model-00009-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.1.w1.weight": "model-00009-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.1.w3.weight": "model-00009-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.1.w2.weight": "model-00010-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.1.w1.weight": "model-00010-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.1.w3.weight": "model-00010-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.1.w2.weight": "model-00010-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.1.w1.weight": "model-00010-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.1.w3.weight": "model-00010-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.1.w2.weight": "model-00010-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.1.w1.weight": "model-00010-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.1.w3.weight": "model-00010-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.1.w2.weight": "model-00010-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.1.w1.weight": "model-00010-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.1.w3.weight": "model-00010-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.1.w2.weight": "model-00010-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.1.w1.weight": "model-00010-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.1.w3.weight": "model-00010-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.1.w2.weight": "model-00010-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.1.w1.weight": "model-00010-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.1.w3.weight": "model-00010-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.1.w2.weight": "model-00010-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.1.w1.weight": "model-00011-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.1.w3.weight": "model-00011-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.1.w2.weight": "model-00011-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.1.w1.weight": "model-00011-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.1.w3.weight": "model-00011-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.1.w2.weight": "model-00011-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.1.w1.weight": "model-00011-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.1.w3.weight": "model-00011-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.1.w2.weight": "model-00011-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.1.w1.weight": "model-00011-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.1.w3.weight": "model-00011-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.1.w2.weight": "model-00011-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.1.w1.weight": "model-00011-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.1.w3.weight": "model-00011-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.1.w2.weight": "model-00011-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.1.w1.weight": "model-00011-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.1.w3.weight": "model-00011-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.1.w2.weight": "model-00011-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.1.w1.weight": "model-00011-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.1.w3.weight": "model-00011-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.1.w2.weight": "model-00012-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.2.w1.weight": "model-00012-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.2.w3.weight": "model-00012-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.2.w2.weight": "model-00012-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.2.w1.weight": "model-00012-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.2.w3.weight": "model-00012-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.2.w2.weight": "model-00012-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.2.w1.weight": "model-00012-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.2.w3.weight": "model-00012-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.2.w2.weight": "model-00012-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.2.w1.weight": "model-00012-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.2.w3.weight": "model-00012-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.2.w2.weight": "model-00012-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.2.w1.weight": "model-00012-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.2.w3.weight": "model-00012-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.2.w2.weight": "model-00012-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.2.w1.weight": "model-00012-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.2.w3.weight": "model-00012-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.2.w2.weight": "model-00012-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.2.w1.weight": "model-00013-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.2.w3.weight": "model-00013-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.2.w2.weight": "model-00013-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.2.w1.weight": "model-00013-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.2.w3.weight": "model-00013-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.2.w2.weight": "model-00013-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.2.w1.weight": "model-00013-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.2.w3.weight": "model-00013-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.2.w2.weight": "model-00013-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.2.w1.weight": "model-00013-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.2.w3.weight": "model-00013-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.2.w2.weight": "model-00013-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.2.w1.weight": "model-00013-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.2.w3.weight": "model-00013-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.2.w2.weight": "model-00013-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.2.w1.weight": "model-00013-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.2.w3.weight": "model-00013-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.2.w2.weight": "model-00013-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.2.w1.weight": "model-00013-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.2.w3.weight": "model-00013-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.2.w2.weight": "model-00014-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.2.w1.weight": "model-00014-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.2.w3.weight": "model-00014-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.2.w2.weight": "model-00014-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.2.w1.weight": "model-00014-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.2.w3.weight": "model-00014-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.2.w2.weight": "model-00014-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.2.w1.weight": "model-00014-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.2.w3.weight": "model-00014-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.2.w2.weight": "model-00014-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.2.w1.weight": "model-00014-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.2.w3.weight": "model-00014-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.2.w2.weight": "model-00014-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.2.w1.weight": "model-00014-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.2.w3.weight": "model-00014-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.2.w2.weight": "model-00014-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.2.w1.weight": "model-00014-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.2.w3.weight": "model-00014-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.2.w2.weight": "model-00014-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.2.w1.weight": "model-00015-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.2.w3.weight": "model-00015-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.2.w2.weight": "model-00015-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.2.w1.weight": "model-00015-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.2.w3.weight": "model-00015-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.2.w2.weight": "model-00015-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.3.w1.weight": "model-00015-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.3.w3.weight": "model-00015-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.3.w2.weight": "model-00015-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.3.w1.weight": "model-00015-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.3.w3.weight": "model-00015-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.3.w2.weight": "model-00015-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.3.w1.weight": "model-00015-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.3.w3.weight": "model-00015-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.3.w2.weight": "model-00015-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.3.w1.weight": "model-00015-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.3.w3.weight": "model-00015-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.3.w2.weight": "model-00015-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.3.w1.weight": "model-00015-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.3.w3.weight": "model-00015-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.3.w2.weight": "model-00016-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.3.w1.weight": "model-00016-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.3.w3.weight": "model-00016-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.3.w2.weight": "model-00016-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.3.w1.weight": "model-00016-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.3.w3.weight": "model-00016-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.3.w2.weight": "model-00016-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.3.w1.weight": "model-00016-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.3.w3.weight": "model-00016-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.3.w2.weight": "model-00016-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.3.w1.weight": "model-00016-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.3.w3.weight": "model-00016-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.3.w2.weight": "model-00016-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.3.w1.weight": "model-00016-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.3.w3.weight": "model-00016-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.3.w2.weight": "model-00016-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.3.w1.weight": "model-00016-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.3.w3.weight": "model-00016-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.3.w2.weight": "model-00016-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.3.w1.weight": "model-00017-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.3.w3.weight": "model-00017-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.3.w2.weight": "model-00017-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.3.w1.weight": "model-00017-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.3.w3.weight": "model-00017-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.3.w2.weight": "model-00017-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.3.w1.weight": "model-00017-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.3.w3.weight": "model-00017-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.3.w2.weight": "model-00017-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.3.w1.weight": "model-00017-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.3.w3.weight": "model-00017-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.3.w2.weight": "model-00017-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.3.w1.weight": "model-00017-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.3.w3.weight": "model-00017-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.3.w2.weight": "model-00017-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.3.w1.weight": "model-00017-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.3.w3.weight": "model-00017-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.3.w2.weight": "model-00017-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.3.w1.weight": "model-00017-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.3.w3.weight": "model-00017-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.3.w2.weight": "model-00018-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.3.w1.weight": "model-00018-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.3.w3.weight": "model-00018-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.3.w2.weight": "model-00018-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.3.w1.weight": "model-00018-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.3.w3.weight": "model-00018-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.3.w2.weight": "model-00018-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.3.w1.weight": "model-00018-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.3.w3.weight": "model-00018-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.3.w2.weight": "model-00018-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.4.w1.weight": "model-00018-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.4.w3.weight": "model-00018-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.4.w2.weight": "model-00018-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.4.w1.weight": "model-00018-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.4.w3.weight": "model-00018-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.4.w2.weight": "model-00018-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.4.w1.weight": "model-00018-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.4.w3.weight": "model-00018-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.4.w2.weight": "model-00018-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.4.w1.weight": "model-00019-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.4.w3.weight": "model-00019-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.4.w2.weight": "model-00019-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.4.w1.weight": "model-00019-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.4.w3.weight": "model-00019-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.4.w2.weight": "model-00019-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.4.w1.weight": "model-00019-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.4.w3.weight": "model-00019-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.4.w2.weight": "model-00019-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.4.w1.weight": "model-00019-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.4.w3.weight": "model-00019-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.4.w2.weight": "model-00019-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.4.w1.weight": "model-00019-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.4.w3.weight": "model-00019-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.4.w2.weight": "model-00019-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.4.w1.weight": "model-00019-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.4.w3.weight": "model-00019-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.4.w2.weight": "model-00019-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.4.w1.weight": "model-00019-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.4.w3.weight": "model-00019-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.4.w2.weight": "model-00020-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.4.w1.weight": "model-00020-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.4.w3.weight": "model-00020-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.4.w2.weight": "model-00020-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.4.w1.weight": "model-00020-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.4.w3.weight": "model-00020-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.4.w2.weight": "model-00020-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.4.w1.weight": "model-00020-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.4.w3.weight": "model-00020-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.4.w2.weight": "model-00020-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.4.w1.weight": "model-00020-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.4.w3.weight": "model-00020-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.4.w2.weight": "model-00020-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.4.w1.weight": "model-00020-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.4.w3.weight": "model-00020-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.4.w2.weight": "model-00020-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.4.w1.weight": "model-00020-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.4.w3.weight": "model-00020-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.4.w2.weight": "model-00020-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.4.w1.weight": "model-00021-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.4.w3.weight": "model-00021-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.4.w2.weight": "model-00021-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.4.w1.weight": "model-00021-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.4.w3.weight": "model-00021-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.4.w2.weight": "model-00021-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.4.w1.weight": "model-00021-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.4.w3.weight": "model-00021-of-00413.safetensors",
        "model.layers.18.block_sparse_moe.experts.4.w2.weight": "model-00021-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.4.w1.weight": "model-00021-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.4.w3.weight": "model-00021-of-00413.safetensors",
        "model.layers.19.block_sparse_moe.experts.4.w2.weight": "model-00021-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.4.w1.weight": "model-00021-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.4.w3.weight": "model-00021-of-00413.safetensors",
        "model.layers.20.block_sparse_moe.experts.4.w2.weight": "model-00021-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.5.w1.weight": "model-00021-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.5.w3.weight": "model-00021-of-00413.safetensors",
        "model.layers.0.block_sparse_moe.experts.5.w2.weight": "model-00021-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.5.w1.weight": "model-00021-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.5.w3.weight": "model-00021-of-00413.safetensors",
        "model.layers.1.block_sparse_moe.experts.5.w2.weight": "model-00022-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.5.w1.weight": "model-00022-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.5.w3.weight": "model-00022-of-00413.safetensors",
        "model.layers.2.block_sparse_moe.experts.5.w2.weight": "model-00022-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.5.w1.weight": "model-00022-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.5.w3.weight": "model-00022-of-00413.safetensors",
        "model.layers.3.block_sparse_moe.experts.5.w2.weight": "model-00022-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.5.w1.weight": "model-00022-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.5.w3.weight": "model-00022-of-00413.safetensors",
        "model.layers.4.block_sparse_moe.experts.5.w2.weight": "model-00022-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.5.w1.weight": "model-00022-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.5.w3.weight": "model-00022-of-00413.safetensors",
        "model.layers.5.block_sparse_moe.experts.5.w2.weight": "model-00022-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.5.w1.weight": "model-00022-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.5.w3.weight": "model-00022-of-00413.safetensors",
        "model.layers.6.block_sparse_moe.experts.5.w2.weight": "model-00022-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.5.w1.weight": "model-00022-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.5.w3.weight": "model-00022-of-00413.safetensors",
        "model.layers.7.block_sparse_moe.experts.5.w2.weight": "model-00022-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.5.w1.weight": "model-00023-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.5.w3.weight": "model-00023-of-00413.safetensors",
        "model.layers.8.block_sparse_moe.experts.5.w2.weight": "model-00023-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.5.w1.weight": "model-00023-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.5.w3.weight": "model-00023-of-00413.safetensors",
        "model.layers.9.block_sparse_moe.experts.5.w2.weight": "model-00023-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.5.w1.weight": "model-00023-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.5.w3.weight": "model-00023-of-00413.safetensors",
        "model.layers.10.block_sparse_moe.experts.5.w2.weight": "model-00023-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.5.w1.weight": "model-00023-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.5.w3.weight": "model-00023-of-00413.safetensors",
        "model.layers.11.block_sparse_moe.experts.5.w2.weight": "model-00023-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.5.w1.weight": "model-00023-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.5.w3.weight": "model-00023-of-00413.safetensors",
        "model.layers.12.block_sparse_moe.experts.5.w2.weight": "model-00023-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.5.w1.weight": "model-00023-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.5.w3.weight": "model-00023-of-00413.safetensors",
        "model.layers.13.block_sparse_moe.experts.5.w2.weight": "model-00023-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.5.w1.weight": "model-00023-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.5.w3.weight": "model-00023-of-00413.safetensors",
        "model.layers.14.block_sparse_moe.experts.5.w2.weight": "model-00024-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.5.w1.weight": "model-00024-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.5.w3.weight": "model-00024-of-00413.safetensors",
        "model.layers.15.block_sparse_moe.experts.5.w2.weight": "model-00024-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.5.w1.weight": "model-00024-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.5.w3.weight": "model-00024-of-00413.safetensors",
        "model.layers.16.block_sparse_moe.experts.5.w2.weight": "model-00024-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.5.w1.weight": "model-00024-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.5.w3.weight": "model-00024-of-00413.safetensors",
        "model.layers.17.block_sparse_moe.experts.5.w2.weight": "model-00024-of-00413.safetensors",
